In [1]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
import seaborn as sns

In [2]:
fert = pd.read_csv('data/gapminder_total_fertility.csv', index_col=0)

In [3]:
life = pd.read_excel('data/gapminder_lifeexpectancy.xlsx', index_col=0)

In [4]:
life.columns

Index([1800, 1801, 1802, 1803, 1804, 1805, 1806, 1807, 1808, 1809,
       ...
       2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016],
      dtype='int64', length=217)

In [25]:
life.shape

(56420, 3)

In [26]:
fert.shape

(56160, 3)

In [5]:
fert.columns=fert.columns.astype(int)

In [6]:
fert.columns

Index([1800, 1801, 1802, 1803, 1804, 1805, 1806, 1807, 1808, 1809,
       ...
       2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015],
      dtype='int64', length=216)

In [7]:
fert.index

Index(['Abkhazia', 'Afghanistan', 'Akrotiri and Dhekelia', 'Albania',
       'Algeria', 'American Samoa', 'Andorra', 'Angola', 'Anguilla',
       'Antigua and Barbuda',
       ...
       'Vietnam', 'Virgin Islands (U.S.)', 'North Yemen (former)',
       'South Yemen (former)', 'Yemen', 'Yugoslavia', 'Zambia', 'Zimbabwe',
       'Åland', 'Åland'],
      dtype='object', name='Total fertility rate', length=260)

In [8]:
life.index.name

'Life expectancy'

In [11]:
population = pd.read_excel('data/gapminder_population.xlsx', index_col=0)

In [12]:
population.index.name

'Total population'

In [13]:
fert.index.rename('country', inplace=True)

In [21]:
life.index.name = 'country'

In [14]:
population.index.rename('country', inplace=True)

In [15]:
population.index.name

'country'

In [19]:
fert = fert.reset_index().melt(id_vars='country', var_name='year', value_name='fertility')

In [22]:
life = life.reset_index().melt(id_vars='country', var_name='year', value_name='life expectancy')

In [23]:
population = population.reset_index().melt(id_vars='country', var_name='year', value_name='population')

In [61]:
df = pd.merge(fert, life, how='outer', on=['country', 'year'])

In [62]:
df

                     country  year  fertility  life expectancy
0                   Abkhazia  1800        NaN              NaN
1                Afghanistan  1800       7.00            28.21
2      Akrotiri and Dhekelia  1800        NaN              NaN
3                    Albania  1800       4.60            35.40
4                    Algeria  1800       6.99            28.82
...                      ...   ...        ...              ...
56631             Yugoslavia  2016        NaN              NaN
56632                 Zambia  2016        NaN            57.10
56633               Zimbabwe  2016        NaN            61.69
56634                  Åland  2016        NaN              NaN
56635            South Sudan  2016        NaN            56.10

[56636 rows x 4 columns]

In [63]:
pd.merge(fert, life, how='outer', on=['country', 'year'])

                     country  year  fertility  life expectancy
0                   Abkhazia  1800        NaN              NaN
1                Afghanistan  1800       7.00            28.21
2      Akrotiri and Dhekelia  1800        NaN              NaN
3                    Albania  1800       4.60            35.40
4                    Algeria  1800       6.99            28.82
...                      ...   ...        ...              ...
56631             Yugoslavia  2016        NaN              NaN
56632                 Zambia  2016        NaN            57.10
56633               Zimbabwe  2016        NaN            61.69
56634                  Åland  2016        NaN              NaN
56635            South Sudan  2016        NaN            56.10

[56636 rows x 4 columns]

In [64]:
df = pd.merge(df, population, on=['country', 'year'])

In [65]:
df

                     country  year  fertility  life expectancy  population
0                   Abkhazia  1800        NaN              NaN         NaN
1                Afghanistan  1800       7.00            28.21   3280000.0
2      Akrotiri and Dhekelia  1800        NaN              NaN         NaN
3                    Albania  1800       4.60            35.40    410445.0
4                    Algeria  1800       6.99            28.82   2503218.0
...                      ...   ...        ...              ...         ...
21055            South Sudan  2011        NaN            55.90  10510122.0
21056            South Sudan  2012        NaN            56.00  10980623.0
21057            South Sudan  2013        NaN            56.00  11453810.0
21058            South Sudan  2014        NaN            56.10  11911184.0
21059            South Sudan  2015        NaN            56.10  12339812.0

[21060 rows x 5 columns]

In [56]:
population

                                            country  year  population
0                                          Abkhazia  1800         NaN
1                                       Afghanistan  1800   3280000.0
2                             Akrotiri and Dhekelia  1800         NaN
3                                           Albania  1800    410445.0
4                                           Algeria  1800   2503218.0
...                                             ...   ...         ...
22270                             Northern Marianas  2015         NaN
22271  South Georgia and the South Sandwich Islands  2015         NaN
22272                     US Minor Outlying Islands  2015         NaN
22273                                Virgin Islands  2015         NaN
22274                                     West Bank  2015         NaN

[22275 rows x 3 columns]

In [67]:
help(pd.concat)

Help on function concat in module pandas.core.reshape.concat:

concat(objs: 'Iterable[Series | DataFrame] | Mapping[HashableT, Series | DataFrame]', *, axis: 'Axis' = 0, join: 'str' = 'outer', ignore_index: 'bool' = False, keys=None, levels=None, names: 'list[HashableT] | None' = None, verify_integrity: 'bool' = False, sort: 'bool' = False, copy: 'bool | None' = None) -> 'DataFrame | Series'
    Concatenate pandas objects along a particular axis.

    Allows optional set logic along the other axes.

    Can also add a layer of hierarchical indexing on the concatenation axis,
    which may be useful if the labels are the same (or overlapping) on
    the passed axis number.

    Parameters
    ----------
    objs : a sequence or mapping of Series or DataFrame objects
        If a mapping is passed, the sorted keys will be used as the `keys`
        argument, unless it is passed, in which case the values will be
        selected (see below). Any None objects will be dropped silently unless
        they are all None in which case a ValueError will be raised.
    axis : {0/'index', 1/'columns'}, default 0
        The axis to concatenate along.
    join : {'inner', 'outer'}, default 'outer'
        How to handle indexes on other axis (or axes).
    ignore_index : bool, default False
        If True, do not use the index values along the concatenation axis. The
        resulting axis will be labeled 0, ..., n - 1. This is useful if you are
        concatenating objects where the concatenation axis does not have
        meaningful indexing information. Note the index values on the other
        axes are still respected in the join.
    keys : sequence, default None
        If multiple levels passed, should contain tuples. Construct
        hierarchical index using the passed keys as the outermost level.
    levels : list of sequences, default None
        Specific levels (unique values) to use for constructing a
        MultiIndex. Otherwise they will be inferred from the keys.
    names : list, default None
        Names for the levels in the resulting hierarchical index.
    verify_integrity : bool, default False
        Check whether the new concatenated axis contains duplicates. This can
        be very expensive relative to the actual data concatenation.
    sort : bool, default False
        Sort non-concatenation axis if it is not already aligned.

    copy : bool, default True
        If False, do not copy data unnecessarily.

    Returns
    -------
    object, type of objs
        When concatenating all ``Series`` along the index (axis=0), a
        ``Series`` is returned. When ``objs`` contains at least one
        ``DataFrame``, a ``DataFrame`` is returned. When concatenating along
        the columns (axis=1), a ``DataFrame`` is returned.

    See Also
    --------
    DataFrame.join : Join DataFrames using indexes.
    DataFrame.merge : Merge DataFrames by indexes or columns.

    Notes
    -----
    The keys, levels, and names arguments are all optional.

    A walkthrough of how this method fits in with other tools for combining
    pandas objects can be found `here
    <https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html>`__.

    It is not recommended to build DataFrames by adding single rows in a
    for loop. Build a list of rows and make a DataFrame in a single concat.

    Examples
    --------
    Combine two ``Series``.

    >>> s1 = pd.Series(['a', 'b'])
    >>> s2 = pd.Series(['c', 'd'])
    >>> pd.concat([s1, s2])
    0    a
    1    b
    0    c
    1    d
    dtype: object

    Clear the existing index and reset it in the result
    by setting the ``ignore_index`` option to ``True``.

    >>> pd.concat([s1, s2], ignore_index=True)
    0    a
    1    b
    2    c
    3    d
    dtype: object

    Add a hierarchical index at the outermost level of
    the data with the ``keys`` option.

    >>> pd.concat([s1, s2], keys=['s1', 's2'])
    s1  0    a
        1    b
    s2  0    c
        1    d
    dtype: object

    Label the index keys you create with the ``names`` option.

    >>> pd.concat([s1, s2], keys=['s1', 's2'],
    ...           names=['Series name', 'Row ID'])
    Series name  Row ID
    s1           0         a
                 1         b
    s2           0         c
                 1         d
    dtype: object

    Combine two ``DataFrame`` objects with identical columns.

    >>> df1 = pd.DataFrame([['a', 1], ['b', 2]],
    ...                    columns=['letter', 'number'])
    >>> df1
      letter  number
    0      a       1
    1      b       2
    >>> df2 = pd.DataFrame([['c', 3], ['d', 4]],
    ...                    columns=['letter', 'number'])
    >>> df2
      letter  number
    0      c       3
    1      d       4
    >>> pd.concat([df1, df2])
      letter  number
    0      a       1
    1      b       2
    0      c       3
    1      d       4

    Combine ``DataFrame`` objects with overlapping columns
    and return everything. Columns outside the intersection will
    be filled with ``NaN`` values.

    >>> df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
    ...                    columns=['letter', 'number', 'animal'])
    >>> df3
      letter  number animal
    0      c       3    cat
    1      d       4    dog
    >>> pd.concat([df1, df3], sort=False)
      letter  number animal
    0      a       1    NaN
    1      b       2    NaN
    0      c       3    cat
    1      d       4    dog

    Combine ``DataFrame`` objects with overlapping columns
    and return only those that are shared by passing ``inner`` to
    the ``join`` keyword argument.

    >>> pd.concat([df1, df3], join="inner")
      letter  number
    0      a       1
    1      b       2
    0      c       3
    1      d       4

    Combine ``DataFrame`` objects horizontally along the x axis by
    passing in ``axis=1``.

    >>> df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
    ...                    columns=['animal', 'name'])
    >>> pd.concat([df1, df4], axis=1)
      letter  number  animal    name
    0      a       1    bird   polly
    1      b       2  monkey  george

    Prevent the result from including duplicate index values with the
    ``verify_integrity`` option.

    >>> df5 = pd.DataFrame([1], index=['a'])
    >>> df5
       0
    a  1
    >>> df6 = pd.DataFrame([2], index=['a'])
    >>> df6
       0
    a  2
    >>> pd.concat([df5, df6], verify_integrity=True)
    Traceback (most recent call last):
        ...
    ValueError: Indexes have overlapping values: ['a']

    Append a single row to the end of a ``DataFrame`` object.

    >>> df7 = pd.DataFrame({'a': 1, 'b': 2}, index=[0])
    >>> df7
        a   b
    0   1   2
    >>> new_row = pd.Series({'a': 3, 'b': 4})
    >>> new_row
    a    3
    b    4
    dtype: int64
    >>> pd.concat([df7, new_row.to_frame().T], ignore_index=True)
        a   b
    0   1   2
    1   3   4

In [74]:
fert.year.nunique()

216